app/serializers/class_room_serializer.rb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def name_teacher
    teach = Teacher.find_by id: object.teacher_id