app/controllers/api/v1/class_users_controller.rb

INSERT INTO "class_users" ("user_id", "class_room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["class_room_id", 5], ["created_at", "2021-05-19 03:51:39.767014"], ["updated_at", "2021-05-19 03:51:39.767014"]]
---
  def create_class_user
    @class_user = ClassUser.new params_class_user
    if @class_user.save

SELECT 1 AS one FROM "class_users" WHERE (user_id = '1' and class_room_id = 1) LIMIT $1  [["LIMIT", 1]]
---
  def create
    check = ClassUser.check_class_user(params[:user_id], params[:class_room_id])
    if check.empty?