app/controllers/api/v1/class_rooms_controller.rb

SELECT "class_rooms".* FROM "class_rooms" WHERE "class_rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def load_class_room
    @class_room = ClassRoom.show_class.find_by id: params[:id]

INSERT INTO "class_rooms" ("name", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "updatexxx"], ["teacher_id", 2], ["created_at", "2021-05-08 09:21:37.375595"], ["updated_at", "2021-05-08 09:21:37.375595"]]
---
  def create
    @class_room = ClassRoom.new class_room_params
    if @class_room.save