app/controllers/api/v1/class_rooms_controller.rb

  def index
    @class_room = ClassRoom.all.show
---
SELECT "class_rooms".* FROM "class_rooms"

  def create
    @class_room = ClassRoom.new(name: params[:name], delete_class_room: false)
    if @class_room.save
---
INSERT INTO "class_rooms" ("name", "delete_class_room", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "class_room_1 "], ["delete_class_room", false], ["created_at", "2021-05-14 08:13:30.696657"], ["updated_at", "2021-05-14 08:13:30.696657"]]

  def load_class_room
    @class_room = ClassRoom.show.find_by id: params[:id]
---
SELECT "class_rooms".* FROM "class_rooms" WHERE "class_rooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    @class_room.update delete_class_room: true
---
UPDATE "class_rooms" SET "delete_class_room" = $1, "updated_at" = $2 WHERE "class_rooms"."id" = $3  [["delete_class_room", true], ["updated_at", "2021-05-17 02:52:56.804337"], ["id", 2]]

  def update
    @class_room.update params_class_user
---
UPDATE "class_rooms" SET "name" = $1, "updated_at" = $2 WHERE "class_rooms"."id" = $3  [["name", "class_room "], ["updated_at", "2021-05-14 05:15:47.248279"], ["id", 3]]