app/controllers/api/v1/student_classes_controller.rb

  def index
    @student_class = StudentClass.show_student
    if @student_class.empty?
---
SELECT "student_classes".* FROM "student_classes" WHERE (class_room_id = '44444' )
SELECT 1 AS one FROM "student_classes" LIMIT $1  [["LIMIT", 1]]

  def add_user
    @user = User.find_by id: @student_class.Student.user_id
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]

  def load_student_class
    @student_class = StudentClass.show_student.find_by id: params[:id]
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "student_classes".* FROM "student_classes" WHERE "student_classes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    byebug
    @student_class = StudentClass.new params_student_class
    byebug
    if @student_class.save
---
INSERT INTO "student_classes" ("student_id", "class_room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["student_id", 8], ["class_room_id", 2], ["created_at", "2021-05-08 10:26:23.147485"], ["updated_at", "2021-05-08 10:26:23.147485"]]

  def update
    if @student_class.nil?
      render json: {
               status: true,
               message: "404",
             }
    else
      @student_class.update params_student_class
---
UPDATE "student_classes" SET "updated_at" = $1, "delete_student" = $2 WHERE "student_classes"."id" = $3  [["updated_at", "2021-05-10 09:45:24.470433"], ["delete_student", true], ["id", 5]]

  def delete_student
    if @student_class.nil?
      render json: {
               status: true,
               message: "404",
             }
    else
      @student_class.update delete_student: true
---
UPDATE "student_classes" SET "updated_at" = $1, "delete_student" = $2 WHERE "student_classes"."id" = $3  [["updated_at", "2021-05-10 09:50:05.803956"], ["delete_student", true], ["id", 6]]